###################################################################

# Created by write_sdc on Tue Apr 17 16:46:53 2018

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_fanout 20 [current_design]
set_max_transition 0.5 [current_design]
set_max_area 0
set_load -pin_load 0.5 [get_ports {AluResult[31]}]
set_load -pin_load 0.5 [get_ports {AluResult[30]}]
set_load -pin_load 0.5 [get_ports {AluResult[29]}]
set_load -pin_load 0.5 [get_ports {AluResult[28]}]
set_load -pin_load 0.5 [get_ports {AluResult[27]}]
set_load -pin_load 0.5 [get_ports {AluResult[26]}]
set_load -pin_load 0.5 [get_ports {AluResult[25]}]
set_load -pin_load 0.5 [get_ports {AluResult[24]}]
set_load -pin_load 0.5 [get_ports {AluResult[23]}]
set_load -pin_load 0.5 [get_ports {AluResult[22]}]
set_load -pin_load 0.5 [get_ports {AluResult[21]}]
set_load -pin_load 0.5 [get_ports {AluResult[20]}]
set_load -pin_load 0.5 [get_ports {AluResult[19]}]
set_load -pin_load 0.5 [get_ports {AluResult[18]}]
set_load -pin_load 0.5 [get_ports {AluResult[17]}]
set_load -pin_load 0.5 [get_ports {AluResult[16]}]
set_load -pin_load 0.5 [get_ports {AluResult[15]}]
set_load -pin_load 0.5 [get_ports {AluResult[14]}]
set_load -pin_load 0.5 [get_ports {AluResult[13]}]
set_load -pin_load 0.5 [get_ports {AluResult[12]}]
set_load -pin_load 0.5 [get_ports {AluResult[11]}]
set_load -pin_load 0.5 [get_ports {AluResult[10]}]
set_load -pin_load 0.5 [get_ports {AluResult[9]}]
set_load -pin_load 0.5 [get_ports {AluResult[8]}]
set_load -pin_load 0.5 [get_ports {AluResult[7]}]
set_load -pin_load 0.5 [get_ports {AluResult[6]}]
set_load -pin_load 0.5 [get_ports {AluResult[5]}]
set_load -pin_load 0.5 [get_ports {AluResult[4]}]
set_load -pin_load 0.5 [get_ports {AluResult[3]}]
set_load -pin_load 0.5 [get_ports {AluResult[2]}]
set_load -pin_load 0.5 [get_ports {AluResult[1]}]
set_load -pin_load 0.5 [get_ports {AluResult[0]}]
set_load -pin_load 0.5 [get_ports {BjBus[32]}]
set_load -pin_load 0.5 [get_ports {BjBus[31]}]
set_load -pin_load 0.5 [get_ports {BjBus[30]}]
set_load -pin_load 0.5 [get_ports {BjBus[29]}]
set_load -pin_load 0.5 [get_ports {BjBus[28]}]
set_load -pin_load 0.5 [get_ports {BjBus[27]}]
set_load -pin_load 0.5 [get_ports {BjBus[26]}]
set_load -pin_load 0.5 [get_ports {BjBus[25]}]
set_load -pin_load 0.5 [get_ports {BjBus[24]}]
set_load -pin_load 0.5 [get_ports {BjBus[23]}]
set_load -pin_load 0.5 [get_ports {BjBus[22]}]
set_load -pin_load 0.5 [get_ports {BjBus[21]}]
set_load -pin_load 0.5 [get_ports {BjBus[20]}]
set_load -pin_load 0.5 [get_ports {BjBus[19]}]
set_load -pin_load 0.5 [get_ports {BjBus[18]}]
set_load -pin_load 0.5 [get_ports {BjBus[17]}]
set_load -pin_load 0.5 [get_ports {BjBus[16]}]
set_load -pin_load 0.5 [get_ports {BjBus[15]}]
set_load -pin_load 0.5 [get_ports {BjBus[14]}]
set_load -pin_load 0.5 [get_ports {BjBus[13]}]
set_load -pin_load 0.5 [get_ports {BjBus[12]}]
set_load -pin_load 0.5 [get_ports {BjBus[11]}]
set_load -pin_load 0.5 [get_ports {BjBus[10]}]
set_load -pin_load 0.5 [get_ports {BjBus[9]}]
set_load -pin_load 0.5 [get_ports {BjBus[8]}]
set_load -pin_load 0.5 [get_ports {BjBus[7]}]
set_load -pin_load 0.5 [get_ports {BjBus[6]}]
set_load -pin_load 0.5 [get_ports {BjBus[5]}]
set_load -pin_load 0.5 [get_ports {BjBus[4]}]
set_load -pin_load 0.5 [get_ports {BjBus[3]}]
set_load -pin_load 0.5 [get_ports {BjBus[2]}]
set_load -pin_load 0.5 [get_ports {BjBus[1]}]
set_load -pin_load 0.5 [get_ports {BjBus[0]}]
create_clock -name clk  -period 10  -waveform {0 5}
set_clock_latency 0.2  [get_clocks clk]
set_clock_uncertainty 0.3  [get_clocks clk]
set_input_delay -clock clk  6  [get_ports {Op[2]}]
set_input_delay -clock clk  6  [get_ports {Op[1]}]
set_input_delay -clock clk  6  [get_ports {Op[0]}]
set_input_delay -clock clk  6  [get_ports {S1[31]}]
set_input_delay -clock clk  6  [get_ports {S1[30]}]
set_input_delay -clock clk  6  [get_ports {S1[29]}]
set_input_delay -clock clk  6  [get_ports {S1[28]}]
set_input_delay -clock clk  6  [get_ports {S1[27]}]
set_input_delay -clock clk  6  [get_ports {S1[26]}]
set_input_delay -clock clk  6  [get_ports {S1[25]}]
set_input_delay -clock clk  6  [get_ports {S1[24]}]
set_input_delay -clock clk  6  [get_ports {S1[23]}]
set_input_delay -clock clk  6  [get_ports {S1[22]}]
set_input_delay -clock clk  6  [get_ports {S1[21]}]
set_input_delay -clock clk  6  [get_ports {S1[20]}]
set_input_delay -clock clk  6  [get_ports {S1[19]}]
set_input_delay -clock clk  6  [get_ports {S1[18]}]
set_input_delay -clock clk  6  [get_ports {S1[17]}]
set_input_delay -clock clk  6  [get_ports {S1[16]}]
set_input_delay -clock clk  6  [get_ports {S1[15]}]
set_input_delay -clock clk  6  [get_ports {S1[14]}]
set_input_delay -clock clk  6  [get_ports {S1[13]}]
set_input_delay -clock clk  6  [get_ports {S1[12]}]
set_input_delay -clock clk  6  [get_ports {S1[11]}]
set_input_delay -clock clk  6  [get_ports {S1[10]}]
set_input_delay -clock clk  6  [get_ports {S1[9]}]
set_input_delay -clock clk  6  [get_ports {S1[8]}]
set_input_delay -clock clk  6  [get_ports {S1[7]}]
set_input_delay -clock clk  6  [get_ports {S1[6]}]
set_input_delay -clock clk  6  [get_ports {S1[5]}]
set_input_delay -clock clk  6  [get_ports {S1[4]}]
set_input_delay -clock clk  6  [get_ports {S1[3]}]
set_input_delay -clock clk  6  [get_ports {S1[2]}]
set_input_delay -clock clk  6  [get_ports {S1[1]}]
set_input_delay -clock clk  6  [get_ports {S1[0]}]
set_input_delay -clock clk  6  [get_ports {S2[31]}]
set_input_delay -clock clk  6  [get_ports {S2[30]}]
set_input_delay -clock clk  6  [get_ports {S2[29]}]
set_input_delay -clock clk  6  [get_ports {S2[28]}]
set_input_delay -clock clk  6  [get_ports {S2[27]}]
set_input_delay -clock clk  6  [get_ports {S2[26]}]
set_input_delay -clock clk  6  [get_ports {S2[25]}]
set_input_delay -clock clk  6  [get_ports {S2[24]}]
set_input_delay -clock clk  6  [get_ports {S2[23]}]
set_input_delay -clock clk  6  [get_ports {S2[22]}]
set_input_delay -clock clk  6  [get_ports {S2[21]}]
set_input_delay -clock clk  6  [get_ports {S2[20]}]
set_input_delay -clock clk  6  [get_ports {S2[19]}]
set_input_delay -clock clk  6  [get_ports {S2[18]}]
set_input_delay -clock clk  6  [get_ports {S2[17]}]
set_input_delay -clock clk  6  [get_ports {S2[16]}]
set_input_delay -clock clk  6  [get_ports {S2[15]}]
set_input_delay -clock clk  6  [get_ports {S2[14]}]
set_input_delay -clock clk  6  [get_ports {S2[13]}]
set_input_delay -clock clk  6  [get_ports {S2[12]}]
set_input_delay -clock clk  6  [get_ports {S2[11]}]
set_input_delay -clock clk  6  [get_ports {S2[10]}]
set_input_delay -clock clk  6  [get_ports {S2[9]}]
set_input_delay -clock clk  6  [get_ports {S2[8]}]
set_input_delay -clock clk  6  [get_ports {S2[7]}]
set_input_delay -clock clk  6  [get_ports {S2[6]}]
set_input_delay -clock clk  6  [get_ports {S2[5]}]
set_input_delay -clock clk  6  [get_ports {S2[4]}]
set_input_delay -clock clk  6  [get_ports {S2[3]}]
set_input_delay -clock clk  6  [get_ports {S2[2]}]
set_input_delay -clock clk  6  [get_ports {S2[1]}]
set_input_delay -clock clk  6  [get_ports {S2[0]}]
set_input_delay -clock clk  6  [get_ports {PC[31]}]
set_input_delay -clock clk  6  [get_ports {PC[30]}]
set_input_delay -clock clk  6  [get_ports {PC[29]}]
set_input_delay -clock clk  6  [get_ports {PC[28]}]
set_input_delay -clock clk  6  [get_ports {PC[27]}]
set_input_delay -clock clk  6  [get_ports {PC[26]}]
set_input_delay -clock clk  6  [get_ports {PC[25]}]
set_input_delay -clock clk  6  [get_ports {PC[24]}]
set_input_delay -clock clk  6  [get_ports {PC[23]}]
set_input_delay -clock clk  6  [get_ports {PC[22]}]
set_input_delay -clock clk  6  [get_ports {PC[21]}]
set_input_delay -clock clk  6  [get_ports {PC[20]}]
set_input_delay -clock clk  6  [get_ports {PC[19]}]
set_input_delay -clock clk  6  [get_ports {PC[18]}]
set_input_delay -clock clk  6  [get_ports {PC[17]}]
set_input_delay -clock clk  6  [get_ports {PC[16]}]
set_input_delay -clock clk  6  [get_ports {PC[15]}]
set_input_delay -clock clk  6  [get_ports {PC[14]}]
set_input_delay -clock clk  6  [get_ports {PC[13]}]
set_input_delay -clock clk  6  [get_ports {PC[12]}]
set_input_delay -clock clk  6  [get_ports {PC[11]}]
set_input_delay -clock clk  6  [get_ports {PC[10]}]
set_input_delay -clock clk  6  [get_ports {PC[9]}]
set_input_delay -clock clk  6  [get_ports {PC[8]}]
set_input_delay -clock clk  6  [get_ports {PC[7]}]
set_input_delay -clock clk  6  [get_ports {PC[6]}]
set_input_delay -clock clk  6  [get_ports {PC[5]}]
set_input_delay -clock clk  6  [get_ports {PC[4]}]
set_input_delay -clock clk  6  [get_ports {PC[3]}]
set_input_delay -clock clk  6  [get_ports {PC[2]}]
set_input_delay -clock clk  6  [get_ports {PC[1]}]
set_input_delay -clock clk  6  [get_ports {PC[0]}]
set_output_delay -clock clk  -max 6  [get_ports {AluResult[31]}]
set_output_delay -clock clk  -max 6  [get_ports {AluResult[30]}]
set_output_delay -clock clk  -max 6  [get_ports {AluResult[29]}]
set_output_delay -clock clk  -max 6  [get_ports {AluResult[28]}]
set_output_delay -clock clk  -max 6  [get_ports {AluResult[27]}]
set_output_delay -clock clk  -max 6  [get_ports {AluResult[26]}]
set_output_delay -clock clk  -max 6  [get_ports {AluResult[25]}]
set_output_delay -clock clk  -max 6  [get_ports {AluResult[24]}]
set_output_delay -clock clk  -max 6  [get_ports {AluResult[23]}]
set_output_delay -clock clk  -max 6  [get_ports {AluResult[22]}]
set_output_delay -clock clk  -max 6  [get_ports {AluResult[21]}]
set_output_delay -clock clk  -max 6  [get_ports {AluResult[20]}]
set_output_delay -clock clk  -max 6  [get_ports {AluResult[19]}]
set_output_delay -clock clk  -max 6  [get_ports {AluResult[18]}]
set_output_delay -clock clk  -max 6  [get_ports {AluResult[17]}]
set_output_delay -clock clk  -max 6  [get_ports {AluResult[16]}]
set_output_delay -clock clk  -max 6  [get_ports {AluResult[15]}]
set_output_delay -clock clk  -max 6  [get_ports {AluResult[14]}]
set_output_delay -clock clk  -max 6  [get_ports {AluResult[13]}]
set_output_delay -clock clk  -max 6  [get_ports {AluResult[12]}]
set_output_delay -clock clk  -max 6  [get_ports {AluResult[11]}]
set_output_delay -clock clk  -max 6  [get_ports {AluResult[10]}]
set_output_delay -clock clk  -max 6  [get_ports {AluResult[9]}]
set_output_delay -clock clk  -max 6  [get_ports {AluResult[8]}]
set_output_delay -clock clk  -max 6  [get_ports {AluResult[7]}]
set_output_delay -clock clk  -max 6  [get_ports {AluResult[6]}]
set_output_delay -clock clk  -max 6  [get_ports {AluResult[5]}]
set_output_delay -clock clk  -max 6  [get_ports {AluResult[4]}]
set_output_delay -clock clk  -max 6  [get_ports {AluResult[3]}]
set_output_delay -clock clk  -max 6  [get_ports {AluResult[2]}]
set_output_delay -clock clk  -max 6  [get_ports {AluResult[1]}]
set_output_delay -clock clk  -max 6  [get_ports {AluResult[0]}]
set_output_delay -clock clk  -max 6  [get_ports {BjBus[32]}]
set_output_delay -clock clk  -max 6  [get_ports {BjBus[31]}]
set_output_delay -clock clk  -max 6  [get_ports {BjBus[30]}]
set_output_delay -clock clk  -max 6  [get_ports {BjBus[29]}]
set_output_delay -clock clk  -max 6  [get_ports {BjBus[28]}]
set_output_delay -clock clk  -max 6  [get_ports {BjBus[27]}]
set_output_delay -clock clk  -max 6  [get_ports {BjBus[26]}]
set_output_delay -clock clk  -max 6  [get_ports {BjBus[25]}]
set_output_delay -clock clk  -max 6  [get_ports {BjBus[24]}]
set_output_delay -clock clk  -max 6  [get_ports {BjBus[23]}]
set_output_delay -clock clk  -max 6  [get_ports {BjBus[22]}]
set_output_delay -clock clk  -max 6  [get_ports {BjBus[21]}]
set_output_delay -clock clk  -max 6  [get_ports {BjBus[20]}]
set_output_delay -clock clk  -max 6  [get_ports {BjBus[19]}]
set_output_delay -clock clk  -max 6  [get_ports {BjBus[18]}]
set_output_delay -clock clk  -max 6  [get_ports {BjBus[17]}]
set_output_delay -clock clk  -max 6  [get_ports {BjBus[16]}]
set_output_delay -clock clk  -max 6  [get_ports {BjBus[15]}]
set_output_delay -clock clk  -max 6  [get_ports {BjBus[14]}]
set_output_delay -clock clk  -max 6  [get_ports {BjBus[13]}]
set_output_delay -clock clk  -max 6  [get_ports {BjBus[12]}]
set_output_delay -clock clk  -max 6  [get_ports {BjBus[11]}]
set_output_delay -clock clk  -max 6  [get_ports {BjBus[10]}]
set_output_delay -clock clk  -max 6  [get_ports {BjBus[9]}]
set_output_delay -clock clk  -max 6  [get_ports {BjBus[8]}]
set_output_delay -clock clk  -max 6  [get_ports {BjBus[7]}]
set_output_delay -clock clk  -max 6  [get_ports {BjBus[6]}]
set_output_delay -clock clk  -max 6  [get_ports {BjBus[5]}]
set_output_delay -clock clk  -max 6  [get_ports {BjBus[4]}]
set_output_delay -clock clk  -max 6  [get_ports {BjBus[3]}]
set_output_delay -clock clk  -max 6  [get_ports {BjBus[2]}]
set_output_delay -clock clk  -max 6  [get_ports {BjBus[1]}]
set_output_delay -clock clk  -max 6  [get_ports {BjBus[0]}]
